Staging:
```terraform
Terraform will perform the following actions:

  # aws_route53_record.ot2_staging_designer will be created
  + resource "aws_route53_record" "ot2_staging_designer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ot2.staging.designer.opentrons.com"
      + type            = "A"
      + zone_id         = "Z05234293E36QWCZV1YLE"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.ot2_staging_labware will be created
  + resource "aws_route53_record" "ot2_staging_labware" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ot2.staging.labware.opentrons.com"
      + type            = "A"
      + zone_id         = "Z09738191QM18US5EYR9B"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.docs_cloudfront_distribution.aws_cloudfront_distribution.distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "distribution" {
        id                              = "E2DBE0K9VT8YB9"
        tags                            = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging.docs.opentrons.com"
            "Project"     = "opentrons-docs"
            "environment" = "staging"
            "ou"          = "robotics"
        }
        # (23 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::043748923082:function/docPythonApiRedirect" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::043748923082:function/indexRedirect"
            }

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.labware_library_cloudfront_distribution.aws_cloudfront_distribution.distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "distribution" {
      ~ aliases                         = [
          - "staging.labware.opentrons.com",
        ]
        id                              = "E2IRNVL4J3NTI3"
        tags                            = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging.labware.opentrons.com"
            "Project"     = "opentrons-docs"
            "environment" = "staging"
            "ou"          = "robotics"
        }
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ot2_labware_library_bucket.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentrons.staging.labware.ot2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-labware-ot2"
          + "Project"     = "opentrons-labware-library"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-labware-ot2"
          + "Project"     = "opentrons-labware-library"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.ot2_labware_library_bucket.aws_s3_bucket_lifecycle_configuration.bucket[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "bucket" {
      + bucket                                 = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "cleanup_old_versions"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + noncurrent_days = 14
            }
        }
    }

  # module.ot2_labware_library_bucket.aws_s3_bucket_public_access_block.bucket will be created
  + resource "aws_s3_bucket_public_access_block" "bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.ot2_labware_library_bucket.aws_s3_bucket_versioning.bucket[0] will be created
  + resource "aws_s3_bucket_versioning" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = "Disabled"
          + status     = "Enabled"
        }
    }

  # module.ot2_labware_library_certificate.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "ot2.staging.labware.opentrons.com"
      + domain_validation_options = [
          + {
              + domain_name           = "ot2.staging.labware.opentrons.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "ot2.staging.labware.opentrons.com",
        ]
      + tags                      = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2-labware-library-staging"
          + "Project"     = "opentrons-labware-library"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + tags_all                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2-labware-library-staging"
          + "Project"     = "opentrons-labware-library"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.ot2_labware_library_certificate.aws_acm_certificate_validation.cert[0] will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.ot2_labware_library_certificate.aws_route53_record.validation["ot2.staging.labware.opentrons.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09738191QM18US5EYR9B"
    }

  # module.ot2_labware_library_cloudfront_distribution.aws_cloudfront_distribution.distribution will be created
  + resource "aws_cloudfront_distribution" "distribution" {
      + aliases                         = [
          + "ot2.staging.labware.opentrons.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Staging ot2 labware library (separate infra)"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2.staging.labware.opentrons.com"
          + "Project"     = "opentrons-docs"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + tags_all                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2.staging.labware.opentrons.com"
          + "Project"     = "opentrons-docs"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 404
          + response_code         = 404
          + response_page_path    = "/404.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + target_origin_id       = "opentrons.staging.labware.ot2-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::043748923082:function/indexRedirect"
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "opentrons.staging.labware.ot2.s3.us-east-2.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "opentrons.staging.labware.ot2-origin"
            # (1 unchanged attribute hidden)

          + custom_header {
              + name  = "User-Agent"
              + value = "Opentrons-Labware-Library-Staging-OT2"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }
    }

  # module.ot2_labware_library_cloudfront_distribution.aws_cloudfront_origin_access_control.oac will be created
  + resource "aws_cloudfront_origin_access_control" "oac" {
      + description                       = "OAC for staging labware-ot2 CloudFront distribution"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "staging-labware-ot2-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.ot2_protocol_designer_bucket.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentrons.staging.designer.ot2"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-designer-ot2"
          + "Project"     = "opentrons-protocol-designer"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-designer-ot2"
          + "Project"     = "opentrons-protocol-designer"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.ot2_protocol_designer_bucket.aws_s3_bucket_lifecycle_configuration.bucket[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "bucket" {
      + bucket                                 = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "cleanup_old_versions"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + noncurrent_days = 14
            }
        }
    }

  # module.ot2_protocol_designer_bucket.aws_s3_bucket_public_access_block.bucket will be created
  + resource "aws_s3_bucket_public_access_block" "bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.ot2_protocol_designer_bucket.aws_s3_bucket_versioning.bucket[0] will be created
  + resource "aws_s3_bucket_versioning" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = "Disabled"
          + status     = "Enabled"
        }
    }

  # module.ot2_protocol_designer_certificate.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "ot2.staging.designer.opentrons.com"
      + domain_validation_options = [
          + {
              + domain_name           = "ot2.staging.designer.opentrons.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "ot2.staging.designer.opentrons.com",
        ]
      + tags                      = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2-protocol-designer-staging"
          + "Project"     = "opentrons-protocol-designer"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + tags_all                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2-protocol-designer-staging"
          + "Project"     = "opentrons-protocol-designer"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.ot2_protocol_designer_certificate.aws_acm_certificate_validation.cert[0] will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.ot2_protocol_designer_certificate.aws_route53_record.validation["ot2.staging.designer.opentrons.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05234293E36QWCZV1YLE"
    }

  # module.ot2_protocol_designer_cloudfront_distribution.aws_cloudfront_distribution.distribution will be created
  + resource "aws_cloudfront_distribution" "distribution" {
      + aliases                         = [
          + "ot2.staging.designer.opentrons.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Staging ot2 protocol designer (separate infra)"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2.staging.designer.opentrons.com"
          + "Project"     = "opentrons-docs"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + tags_all                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ot2.staging.designer.opentrons.com"
          + "Project"     = "opentrons-docs"
          + "environment" = "staging"
          + "ou"          = "robotics"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 404
          + response_code         = 404
          + response_page_path    = "/404.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + target_origin_id       = "opentrons.staging.designer.ot2-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::043748923082:function/indexRedirect"
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "opentrons.staging.designer.ot2.s3.us-east-2.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "opentrons.staging.designer.ot2-origin"
            # (1 unchanged attribute hidden)

          + custom_header {
              + name  = "User-Agent"
              + value = "Opentrons-Protocol-Designer-Staging-OT2"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }
    }

  # module.ot2_protocol_designer_cloudfront_distribution.aws_cloudfront_origin_access_control.oac will be created
  + resource "aws_cloudfront_origin_access_control" "oac" {
      + description                       = "OAC for staging designer-ot2 CloudFront distribution"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "staging-designer-ot2-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

Plan: 20 to add, 2 to change, 0 to destroy.